{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_102", "bias_constraint": null, "batch_input_shape": [null, 75, 75, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dtype": "float32", "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "kernel_size": [4, 4]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_97", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_103", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 256, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_98", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_104", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 256, "kernel_size": [2, 2]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_99", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_105", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "filters": 128, "kernel_size": [2, 2]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_100", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_21", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "units": 512, "name": "dense_68", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "units": 256, "name": "dense_69", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "units": 128, "name": "dense_70", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "units": 1, "name": "dense_71", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null}}], "keras_version": "2.0.8"}